# ExportParts Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..ExportParts Property
NavisworksExportOptions Class See Also
---
True to export Revit part elements, false to export the original parent elements. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ExportParts { get; set; }
```

Visual Basic
---
```text
Public Property ExportParts As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportParts {
	bool get ();
	void set (bool value);
}
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace